app/controllers/comments_controller.rb

	def create
	comment = @post.comments.create! comments_params
---
INSERT INTO `comments` (`post_id`, `body`, `created_at`, `updated_at`) VALUES (1, 'Esse comentario veio do form', '2017-01-31 17:30:33', '2017-01-31 17:30:33')

	def set_post
		@post = Post.find(params[:post_id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1